create database VietJet;
use VietJet;

create table ChuyenBay(
	id				int primary key,
    SoHieuChuyenBay	varchar(256),
    GioBay			datetime,
    GioHaCanh		datetime,
    SanBayDi		varchar(256),
    SanBayDen		varchar(256),
    MayBay			varchar(256),
    GiaVe			int,
    SoGheConLai		int
);

create table DatXe(
	id			int primary key,
    NoiDi		varchar(256),
    NoiDen		varchar(256),
    ThoiGian	Datetime,
    Gia			varchar(256)
);

create table ThongTinDatXe(
	id				int primary key,
    TenHanhKhach	varchar(256),
    MaDatXe			int,
    SoDienThoai		varchar(256)
);

create table LoaiBaoHiem(
	id			int primary key,
    TenLoai		varchar(256),
    MieuTa		varchar(256),
    Gia			varchar(256)
);

create table ThongTinMuaBaoHiem(
	id				int primary key,
    MaDatCho		varchar(256),
    MaLoaiBaoHiem	int
)

INSERT INTO `chuyenbay` VALUES (1,'VJ001','2021-06-01 0:00:00','2021-06-01 2:00:00','Tân Sân Nhất','Nội bài','Airbus 787',2000000,100),
(2,'VJ002','2021-06-30 15:10:00','2021-06-30 16:10:00','Nội bài','Hải Phòng','Airbus 787',900000,100),
(3,'VJ003','2021-06-03 4:00:00','2021-06-03 05:00:00','Tân Sân Nhất','Hải Phòng','Airbus A321',1800000,100),
(4,'VJ004','2021-06-04 1:50:00','2021-06-04 2:50:00','Tân Sân Nhất','Đà Nẵng','Airbus 787',900000,100),
(5,'VJ005','2021-06-05 15:00:00','2021-06-05 16:00:00','Tân Sân Nhất','Cần Thơ','Airbus A320',900000,100),
(6,'VJ001','2021-06-06 18:00:00','2021-06-06 20:00:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(7,'VJ002','2021-06-07 0:50:00','2021-06-07 1:50:00','Tân Sân Nhất','Huế','Airbus 787',1500000,100),
(8,'VJ003','2021-06-08 5:20:00','2021-06-08 6:20:00','Tân Sân Nhất','Hải Phòng','Airbus 787',1800000,100),
(9,'VJ004','2021-06-09 9:15:00','2021-06-09 10:10:00','Tân Sân Nhất','Đà Nẵng','Airbus A321',900000,100),
(10,'VJ005','2021-06-10 10:00:00','2021-06-10 11:00:00','Tân Sân Nhất','Cần Thơ','Airbus A320',900000,100),
(11,'VJ001','2021-06-11 19:50:00','2021-06-11 21:50:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(12,'VJ002','2021-06-12 23:15:00','2021-06-13 0:10:00','Tân Sân Nhất','Đà Nẵng','Airbus A320',900000,100),
(13,'VJ003','2021-06-13 22:00:00','2021-06-13 23:00:00','Tân Sân Nhất','Cần Thơ','Airbus 787',900000,100),
(14,'VJ004','2021-06-14 10:00:00','2021-06-14 11:00:00','Tân Sân Nhất','Hải Phòng','Airbus 787',1800000,100),
(15,'VJ005','2021-06-15 21:20:00','2021-06-15 22:20:00','Tân Sân Nhất','Huế','Airbus 787',1500000,100),
(16,'VJ001','2021-06-16 14:00:00','2021-06-16 16:00:00','Nội bài','Tân Sân Nhất','Airbus A321',2000000,100),
(17,'VJ002','2021-06-17 23:30:00','2021-06-18 0:30:00','Nội bài','Hải Phòng','Airbus A320',900000,100),
(18,'VJ003','2021-06-18 7:00:00','2021-06-18 8:00:00','Nội bài','Huế','Airbus A321',900000,100),
(19,'VJ004','2021-06-19 18:00:00','2021-06-19 19:00:00','Nội bài','Cần Thơ','Airbus 787',2500000,100),
(20,'VJ005','2021-06-20 4:00:00','2021-06-20 6:00:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(21,'VJ001','2021-06-21 10:00:00','2021-06-21 11:00:00','Nội bài','Huế','Airbus A321',900000,100),
(22,'VJ002','2021-06-22 6:10:00','2021-06-22 8:10:00','Nội bài','Tân Sân Nhất','Airbus A320',2000000,100),
(23,'VJ003','2021-06-23 17:00:00','2021-06-23 19:00:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(24,'VJ004','2021-06-24 13:00:00','2021-06-24 14:00:00','Nội bài','Hải Phòng','Airbus 787',900000,100),
(25,'VJ005','2021-06-25 12:20:00','2021-06-25 15:50:00','Nội bài','Cần Thơ','Airbus A320',2500000,100),
(26,'VJ001','2021-06-26 14:00:00','2021-06-26 15:00:00','Nội bài','Huế','Airbus 787',900000,100),
(27,'VJ002','2021-06-27 19:00:00','2021-06-27 21:00:00','Tân Sân Nhất','Nội bài','Airbus 787',2000000,100),
(28,'VJ003','2021-06-28 20:00:00','2021-06-28 22:00:00','Nội bài','Tân Sân Nhất','Airbus 787',2000000,100),
(29,'VJ004','2021-06-29 21:00:00','2021-06-29 23:30:00','Nội bài','Cần Thơ','Airbus A320',2500000,100),
(31,'VJ001','2021-06-01 0:00:00','2021-06-01 2:00:00','Tân Sân Nhất','Nội bài','Airbus 787',2000000,100),
(32,'VJ120','2021-06-06 05:00:00','2021-06-06 07:00:00','Tân Sân Nhất','Nội bài','Airbus 123',2000000,100),
(33,'VJ330','2021-06-06 03:00:00','2021-06-06 05:00:00','Tân Sân Nhất','Nội bài','Airbus 513',2000000,100),
(34,'VJ450','2021-06-06 13:00:00','2021-06-06 15:30:00','Tân Sân Nhất','Nội bài','Airbus 212',2500000,100),
(35,'VJ100','2021-06-06 19:00:00','2021-06-06 21:00:00','Tân Sân Nhất','Nội bài','Airbus 000',2000000,100),
(36,'VJ321','2021-06-06 09:00:00','2021-06-06 11:10:00','Tân Sân Nhất','Nội bài','Airbus 444',2000000,100),
(37,'VJ789','2021-06-06 18:00:00','2021-06-06 20:20:00','Tân Sân Nhất','Nội bài','Airbus 183',2000000,100);

INSERT INTO `DatXe` VALUES (1,'San Bay Noi Bai','My Dinh','2021-06-06 00:00:00',150000),
(2,'San Bay Noi Bai','My Dinh','2021-06-06 03:00:00',150000),
(3,'San Bay Noi Bai','My Dinh','2021-06-06 05:00:00',130000),
(4,'San Bay Noi Bai','My Dinh','2021-06-06 07:00:00',100000),
(5,'San Bay Noi Bai','My Dinh','2021-06-06 09:00:00',100000),
(6,'San Bay Noi Bai','My Dinh','2021-06-06 12:00:00',100000),
(7,'San Bay Noi Bai','My Dinh','2021-06-06 14:00:00',100000),
(8,'San Bay Noi Bai','My Dinh','2021-06-06 16:00:00',100000),
(9,'San Bay Noi Bai','My Dinh','2021-06-06 18:00:00',120000),
(10,'San Bay Noi Bai','My Dinh','2021-06-06 20:00:00',120000),
(11,'San Bay Noi Bai','My Dinh','2021-06-06 22:00:00',130000),
(12,'San Bay Tan San Nhat','Quan 1','2021-06-06 00:00:00',150000),
(13,'San Bay Tan San Nhat','Quan 1','2021-06-06 03:00:00',150000),
(14,'San Bay Tan San Nhat','Quan 1','2021-06-06 05:00:00',130000),
(15,'San Bay Tan San Nhat','Quan 1','2021-06-06 07:00:00',100000),
(16,'San Bay Tan San Nhat','Quan 1','2021-06-06 09:00:00',100000),
(17,'San Bay Tan San Nhat','Quan 1','2021-06-06 11:00:00',100000),
(18,'San Bay Tan San Nhat','Quan 1','2021-06-06 13:00:00',100000),
(19,'San Bay Tan San Nhat','Quan 1','2021-06-06 15:00:00',100000),
(20,'San Bay Tan San Nhat','Quan 1','2021-06-06 17:00:00',100000),
(21,'San Bay Tan San Nhat','Quan 1','2021-06-06 19:00:00',120000),
(22,'San Bay Tan San Nhat','Quan 1','2021-06-06 21:00:00',120000),
(23,'San Bay Tan San Nhat','Quan 1','2021-06-06 23:00:00',130000)
