create database VietJet;
use VietJet;

create table ChuyenBay(
	id				int primary key,
    SoHieuChuyenBay	varchar(256),
    GioBay			datetime,
    GioHaCanh		datetime,
    SanBayDi		varchar(256),
    SanBayDen		varchar(256),
    MayBay			varchar(256),
    GiaVe			int,
    SoGheConLai		int
);

create table DatXe(
	id			int primary key,
    NoiDi		varchar(256),
    NoiDen		varchar(256),
    ThoiGian	Datetime,
    Gia			varchar(256)
);

create table ThongTinDatXe(
	id				int primary key,
    TenHanhKhach	varchar(256),
    MaDatXe			int,
    SoDienThoai		varchar(256)
);

create table LoaiBaoHiem(
	id			int primary key,
    TenLoai		varchar(256),
    MieuTa		varchar(256),
    Gia			varchar(256)
);

create table ThongTinMuaBaoHiem(
	id				int primary key,
    MaDatCho		varchar(256),
    MaLoaiBaoHiem	int
)

INSERT INTO `chuyenbay` VALUES (1,'VJ001','2021-06-01 00:00:00','2021-06-01 02:00:00','Tân Sân Nhất','Nội bài','Airbus 787',2000000,100),
(2,'VJ002','2021-06-30 15:10:00','2021-06-30 16:10:00','Nội bài','Hải Phòng','Airbus 787',900000,100),
(3,'VJ003','2021-06-03 04:00:00','2021-06-03 05:00:00','Tân Sân Nhất','Hải Phòng','Airbus A321',1800000,100),
(4,'VJ004','2021-06-04 01:50:00','2021-06-04 02:50:00','Tân Sân Nhất','Đà Nẵng','Airbus 787',900000,100),
(5,'VJ005','2021-06-05 15:00:00','2021-06-05 16:00:00','Tân Sân Nhất','Cần Thơ','Airbus A320',900000,100),
(6,'VJ007','2021-06-06 18:00:00','2021-06-06 20:00:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(7,'VJ008','2021-06-07 00:50:00','2021-06-07 01:50:00','Tân Sân Nhất','Huế','Airbus 787',1500000,100),
(8,'VJ009','2021-06-08 05:20:00','2021-06-08 06:20:00','Tân Sân Nhất','Hải Phòng','Airbus 787',1800000,100),
(9,'VJ010','2021-06-09 09:15:00','2021-06-09 10:10:00','Tân Sân Nhất','Đà Nẵng','Airbus A321',900000,100),
(10,'VJ011','2021-06-10 10:00:00','2021-06-10 11:00:00','Tân Sân Nhất','Cần Thơ','Airbus A320',900000,100),
(11,'VJ012','2021-06-11 19:50:00','2021-06-11 21:50:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(12,'VJ013','2021-06-12 23:15:00','2021-06-13 00:10:00','Tân Sân Nhất','Đà Nẵng','Airbus A320',900000,100),
(13,'VJ014','2021-06-13 22:00:00','2021-06-13 23:00:00','Tân Sân Nhất','Cần Thơ','Airbus 787',900000,100),
(14,'VJ015','2021-06-14 10:00:00','2021-06-14 11:00:00','Tân Sân Nhất','Hải Phòng','Airbus 787',1800000,100),
(15,'VJ016','2021-06-15 21:20:00','2021-06-15 22:20:00','Tân Sân Nhất','Huế','Airbus 787',1500000,100),
(16,'VJ017','2021-06-16 14:00:00','2021-06-16 16:00:00','Nội bài','Tân Sân Nhất','Airbus A321',2000000,100),
(17,'VJ018','2021-06-17 23:30:00','2021-06-18 00:30:00','Nội bài','Hải Phòng','Airbus A320',900000,100),
(18,'VJ019','2021-06-18 07:00:00','2021-06-18 08:00:00','Nội bài','Huế','Airbus A321',900000,100),
(19,'VJ020','2021-06-19 18:00:00','2021-06-19 19:00:00','Nội bài','Cần Thơ','Airbus 787',2500000,100),
(20,'VJ021','2021-06-20 04:00:00','2021-06-20 06:00:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(21,'VJ022','2021-06-21 10:00:00','2021-06-21 11:00:00','Nội bài','Huế','Airbus A321',900000,100),
(22,'VJ023','2021-06-22 06:10:00','2021-06-22 08:10:00','Nội bài','Tân Sân Nhất','Airbus A320',2000000,100),
(23,'VJ024','2021-06-23 17:00:00','2021-06-23 19:00:00','Tân Sân Nhất','Nội bài','Airbus 737',2000000,100),
(24,'VJ025','2021-06-24 13:00:00','2021-06-24 14:00:00','Nội bài','Hải Phòng','Airbus 787',900000,100),
(25,'VJ026','2021-06-25 12:20:00','2021-06-25 15:50:00','Nội bài','Cần Thơ','Airbus A320',2500000,100),
(26,'VJ027','2021-06-26 14:00:00','2021-06-26 15:00:00','Nội bài','Huế','Airbus 787',900000,100),
(27,'VJ028','2021-06-27 19:00:00','2021-06-27 21:00:00','Tân Sân Nhất','Nội bài','Airbus 787',2000000,100),
(28,'VJ029','2021-06-28 20:00:00','2021-06-28 22:00:00','Nội bài','Tân Sân Nhất','Airbus 787',2000000,100),
(29,'VJ030','2021-06-29 21:00:00','2021-06-29 23:30:00','Nội bài','Cần Thơ','Airbus A320',2500000,100),
(31,'VJ031','2021-06-01 00:00:00','2021-06-01 02:00:00','Tân Sân Nhất','Nội bài','Airbus 787',2000000,100),
(32,'VJ032','2021-06-06 05:00:00','2021-06-06 07:00:00','Tân Sân Nhất','Nội bài','Airbus 123',2000000,97),
(33,'VJ033','2021-06-06 03:00:00','2021-06-06 05:00:00','Tân Sân Nhất','Nội bài','Airbus 513',2000000,86),
(34,'VJ034','2021-06-06 13:00:00','2021-06-06 15:30:00','Tân Sân Nhất','Nội bài','Airbus 212',2500000,100),
(35,'VJ035','2021-06-06 19:00:00','2021-06-06 21:00:00','Tân Sân Nhất','Nội bài','Airbus 000',2000000,100),
(36,'VJ036','2021-06-06 09:00:00','2021-06-06 11:10:00','Tân Sân Nhất','Nội bài','Airbus 444',2000000,98),
(37,'VJ037','2021-06-06 18:00:00','2021-06-06 20:20:00','Tân Sân Nhất','Nội bài','Airbus 183',2000000,100);


INSERT INTO `DatXe` VALUES (1,'San Bay Noi Bai','My Dinh','2021-06-06 00:00:00',150000),
(2,'San Bay Noi Bai','My Dinh','2021-06-06 03:00:00',150000),
(3,'San Bay Noi Bai','My Dinh','2021-06-06 05:00:00',130000),
(4,'San Bay Noi Bai','My Dinh','2021-06-06 07:00:00',100000),
(5,'San Bay Noi Bai','My Dinh','2021-06-06 09:00:00',100000),
(6,'San Bay Noi Bai','My Dinh','2021-06-06 12:00:00',100000),
(7,'San Bay Noi Bai','My Dinh','2021-06-06 14:00:00',100000),
(8,'San Bay Noi Bai','My Dinh','2021-06-06 16:00:00',100000),
(9,'San Bay Noi Bai','My Dinh','2021-06-06 18:00:00',120000),
(10,'San Bay Noi Bai','My Dinh','2021-06-06 20:00:00',120000),
(11,'San Bay Noi Bai','My Dinh','2021-06-06 22:00:00',130000),
(12,'San Bay Tan San Nhat','Quan 1','2021-06-06 00:00:00',150000),
(13,'San Bay Tan San Nhat','Quan 1','2021-06-06 03:00:00',150000),
(14,'San Bay Tan San Nhat','Quan 1','2021-06-06 05:00:00',130000),
(15,'San Bay Tan San Nhat','Quan 1','2021-06-06 07:00:00',100000),
(16,'San Bay Tan San Nhat','Quan 1','2021-06-06 09:00:00',100000),
(17,'San Bay Tan San Nhat','Quan 1','2021-06-06 11:00:00',100000),
(18,'San Bay Tan San Nhat','Quan 1','2021-06-06 13:00:00',100000),
(19,'San Bay Tan San Nhat','Quan 1','2021-06-06 15:00:00',100000),
(20,'San Bay Tan San Nhat','Quan 1','2021-06-06 17:00:00',100000),
(21,'San Bay Tan San Nhat','Quan 1','2021-06-06 19:00:00',120000),
(22,'San Bay Tan San Nhat','Quan 1','2021-06-06 21:00:00',120000),
(23,'San Bay Tan San Nhat','Quan 1','2021-06-06 23:00:00',130000)
